app/Observers/AuditObserver.php

    public function handle(string $evento, array $payload): void
    {
        $db = \Config\Database::connect();
        $db->table('auditorias')->insert([
            'entidad'     => $payload['model'],
            'entidad_id'  => $payload['id'] ?? null,
            'accion'      => $evento,
            'detalle'     => json_encode($payload['data'] ?? []),
            'user_id'     => session()->get('user')['id_usuario'] ?? null,
            'fecha'       => date('Y-m-d H:i:s'),
        ]);
---
INSERT INTO `auditoria` (`entidad`, `entidad_id`, `accion`, `detalle`, `user_id`, `fecha`) VALUES ('App\\Models\\LibroModel', 2, 'update', '{\"disponibilidad\":\"no_disponible\"}', NULL, '2025-11-13 05:19:00')

    public static function onUserLoggedIn($user)
    {
        // Si usas tabla auditoría:
        $db = \Config\Database::connect();
        $db->table('auditorias')->insert([
            'accion' => 'login',
            'entidad' => 'Login',
            'user_id' => $user['id_usuario'],
            'fecha' => date('Y-m-d H:i:s'),
            'detalle' => json_encode($user),
        ]);
---
INSERT INTO `auditoria` (`accion`, `entidad`, `user_id`, `fecha`, `detalle`) VALUES ('login', 'Login', '2', '2025-11-13 05:24:04', '{\"id_usuario\":\"2\",\"nombre\":\"usuario\",\"apellido\":\"usuario\",\"correo\":\"usuario@ejemplo.com\",\"contrasena\":\"usuario\",\"id_rol\":\"2\",\"username\":\"usuario\"}')