GestiLibro/app/Models/LibroModel.php

    public function conCategoria($disponibilidad = 'disponible')
    {
        $query = $this->select('Libro.*, Categoria.nombre AS nombre_categoria')
                      ->join('Categoria', 'Categoria.id_categoria = Libro.id_categoria', 'left')
                      ->where('libro.disponibilidad', $disponibilidad);

        return $query->findAll();
---
SELECT `Libro`.*, `Categoria`.`nombre` AS `nombre_categoria`
FROM `Libro`
LEFT JOIN `Categoria` ON `Categoria`.`id_categoria` = `Libro`.`id_categoria`
WHERE `libro`.`disponibilidad` = 'disponible'