app/Controllers/CategoriaController.php

    public function index()
    {
        $data['categorias'] = $this->categoriaModel->findAll();
---
SELECT *
FROM `Categoria`