app/Controllers/LibroController.php

SELECT *
FROM `Categoria`
---
    public function create()
    {
        $data['categorias'] = $this->categoriaModel->findAll();

SELECT *
FROM `Categoria`
---
    public function edit($id)
    {
        $data['libro'] = $this->libroModel->find($id);
        $data['categorias'] = $this->categoriaModel->findAll();