app/Controllers/PrestamoController.php

    public function create()
    {
        $data['usuarios'] = $this->usuarioModel->findAll();
        $data['libros'] = $this->libroModel->findAll();
---
SELECT *
FROM `Usuario`
SELECT *
FROM `Libro`