app/Controllers/RolController.php

SELECT COUNT(*) AS `numrows`
FROM `Usuario`
WHERE `id_rol` = '1'
---
    public function delete($id)
    {
        $rol = $this->rolModel->find($id);

        if (!$rol) {
            return redirect()->to('/roles')->with('error', 'Rol no encontrado.');
        }

        // Validación de negocio: no eliminar rol administrador
        if ($rol['nombre'] === 'administrador') {
            return redirect()->to('/roles')->with('error', 'No se puede eliminar el rol administrador.');
        }

        // Validación de negocio: si hay usuarios asociados, no permitir eliminar
        $usuariosAsociados = $this->usuarioModel
            ->where('id_rol', $id)
            ->countAllResults();