app/Models/LibroModel.php

SELECT `Libro`.*, `Categoria`.`nombre` AS `nombre_categoria`
FROM `Libro`
LEFT JOIN `Categoria` ON `Categoria`.`id_categoria` = `Libro`.`id_categoria`
---
    public function conCategoria()
    {
        return $this->select('Libro.*, Categoria.nombre AS nombre_categoria')
                    ->join('Categoria', 'Categoria.id_categoria = Libro.id_categoria', 'left')
                    ->findAll();