app/Models/PrestamoModel.php

    public function conDetalles()
    {
        return $this->select('Prestamo.*, Usuario.nombre AS nombre_usuario, Libro.titulo AS titulo_libro')
                    ->join('Usuario', 'Usuario.id_usuario = Prestamo.id_usuario')
                    ->join('Libro', 'Libro.id_libro = Prestamo.id_libro')
                    ->orderBy('Prestamo.id_prestamo', 'DESC')
                    ->findAll();
---
SELECT `Prestamo`.*, `Usuario`.`nombre` AS `nombre_usuario`, `Libro`.`titulo` AS `titulo_libro`
FROM `Prestamo`
JOIN `Usuario` ON `Usuario`.`id_usuario` = `Prestamo`.`id_usuario`
JOIN `Libro` ON `Libro`.`id_libro` = `Prestamo`.`id_libro`
ORDER BY `Prestamo`.`id_prestamo` DESC