app/Models/UsuarioModel.php

    public function obtenerRol()
    {
        return $this->join('Rol', 'Rol.id_rol = Usuario.id_rol')
                    ->select('Usuario.*, Rol.nombre as rol')
                    ->orderBy('Usuario.id_usuario', 'DESC')
                    ->findAll();
---
SELECT `Usuario`.*, `Rol`.`nombre` as `rol`
FROM `Usuario`
JOIN `Rol` ON `Rol`.`id_rol` = `Usuario`.`id_rol`
ORDER BY `Usuario`.`id_usuario` DESC